# DollarPerBtu Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..DollarPerBtu Property
SymbolTypeId Class See Also
---
Symbol $/Btu, indicating unit Cost per British thermal unit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId DollarPerBtu { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DollarPerBtu As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DollarPerBtu {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace